/* 
   Localizable.strings (Spanish)
   Proxly

   Spanish localization.
*/

// MARK: - Defaults
"defaults.new_rule_name" = "Nueva regla";

// MARK: - Tab Navigation
"tab.rules" = "Reglas";
"tab.settings" = "Configuración";
"tab.about" = "Acerca de";

// MARK: - General UI
"window.title.settings" = "Configuración de Proxly";
"button.add_rule" = "Agregar Regla";
"button.save" = "Guardar";
"button.cancel" = "Cancelar";
"button.delete" = "Eliminar";
"button.ok" = "OK";
"button.open_system_preferences" = "Abrir Preferencias del Sistema";

// MARK: - Settings View
"settings.title" = "Configuración";
"settings.section.general" = "General";
"settings.section.default_behavior" = "Comportamiento Predeterminado";
"settings.section.logging" = "Registro";

"settings.enable_rules.title" = "Habilitar reglas";
"settings.enable_rules.subtitle.enabled" = "Las reglas están activas";
"settings.enable_rules.subtitle.disabled" = "⚠️ ¡Todas las reglas serán ignoradas!";

"settings.launch_at_login.title" = "Iniciar al iniciar sesión";
"settings.launch_at_login.subtitle" = "Iniciar automáticamente Proxly cuando inicies sesión en tu Mac";

"settings.when_no_rule_matches" = "Cuando ninguna regla coincida:";
"settings.default_behavior.show_selection" = "Mostrar selección de navegador";
"settings.default_behavior.open_fallback" = "Abrir navegador de respaldo";

"settings.fallback_browser.title" = "Navegador de Respaldo";
"settings.fallback_browser.subtitle" = "Se usa cuando ninguna regla coincide y se selecciona 'Abrir navegador de respaldo'";

"settings.notify_fallback.title" = "Mostrar notificación cuando se use el navegador de respaldo";
"settings.notify_fallback.subtitle" = "Recibe notificaciones cuando se abra una URL con el navegador de respaldo";

"settings.tooltips.title" = "Mostrar tooltips";
"settings.tooltips.subtitle" = "Mostrar sugerencias útiles al pasar el ratón sobre elementos de la interfaz";
"settings.tooltips.enable_rules" = "Activa o desactiva todas las reglas de enrutamiento del navegador. Cuando está desactivado, todas las reglas se ignoran y se usa el comportamiento predeterminado.";
"settings.tooltips.launch_at_login" = "Cuando está activado, Proxly se iniciará automáticamente al iniciar sesión en tu Mac, asegurando que tus reglas estén siempre activas.";
"settings.tooltips.default_behavior" = "Elige qué sucede cuando ninguna regla coincide con una URL: mostrar el diálogo de selección de navegador o abrir automáticamente con el navegador de respaldo.";
"settings.tooltips.fallback_browser" = "Selecciona qué navegador usar como respaldo cuando ninguna regla coincide y se selecciona la opción de respaldo.";
"settings.tooltips.notify_fallback" = "Cuando está activado, recibirás una notificación cada vez que se abra una URL con el navegador de respaldo.";
"settings.tooltips.enable_logging" = "Habilita el registro para ayudar a diagnosticar problemas. Proxly registrará URLs abiertas y mensajes de diagnóstico. No se recopilan datos personales.";
"settings.tooltips.show_tooltips" = "Activa esta configuración para mostrar u ocultar tooltips útiles al pasar el ratón sobre elementos de la interfaz.";

"settings.logging.enable" = "Activar registro";
"settings.logging.subtitle" = "Cuando está activado, Proxly registrará las URL abiertas y los mensajes de diagnóstico. No se recopilan datos.";

// MARK: - Notifications
"notification.permission.title" = "Permiso de Notificación Requerido";
"notification.permission.message" = "Proxly necesita permiso para enviar notificaciones. Por favor, habilita las notificaciones en Preferencias del Sistema.";
"notification.denied.title" = "Notificaciones Denegadas";
"notification.denied.message" = "Has denegado previamente los permisos de notificación. Por favor, habilita las notificaciones en Preferencias del Sistema si quieres recibir alertas.";
"notification.fallback.title" = "Navegador de Respaldo Usado";
"notification.fallback.body" = "URL abierta en navegador de respaldo: %@";

// MARK: - Rules View
"rules.title" = "Reglas";
"rules.status.enabled" = "Habilitado";
"rules.status.disabled" = "Deshabilitado";
"rules.empty.title" = "Aún No Hay Reglas";
"rules.empty.subtitle" = "Crea tu primera regla para comenzar a enrutar URLs inteligentemente";
"rules.empty.description" = "Las reglas te permiten abrir automáticamente diferentes sitios web en navegadores específicos basándose en dominios, modos de enfoque o hora del día.";
"rules.select.title" = "Seleccionar una Regla";
"rules.select.subtitle" = "Elige una regla de la lista para ver y editar sus detalles";
"rules.priority.title" = "Prioridad";

// MARK: - Rule Edit View
"rule.edit.title.new" = "Agregar Regla";
"rule.edit.title.edit" = "Editar Regla";
"rule.edit.name.placeholder" = "Introduce el nombre de la regla";
"rule.edit.name.empty" = "El nombre de la regla no puede estar vacío";
"rule.edit.name.valid" = "El nombre de la regla es válido";
"rule.edit.saved.title" = "Regla guardada";
"rule.edit.section.name" = "Nombre";
"rule.edit.section.type" = "Tipo de Regla";
"rule.edit.section.condition" = "Condición";
"rule.edit.section.browser" = "Navegador Objetivo";
"rule.edit.section.priority" = "Prioridad";

"rule.condition.placeholder" = "ej., apple.com o Trabajo";
"rule.validation.empty" = "La condición no puede estar vacía.";
"rule.validation.duplicate" = "Ya existe una regla con este tipo y condición.";
"rule.validation.valid" = "La condición es válida";

"rule.priority.title" = "Nivel de Prioridad";
"rule.priority.subtitle" = "Las reglas de mayor prioridad se evalúan primero";

"rule.delete.title" = "Eliminar Regla";
"rule.delete.message" = "¿Estás seguro de que quieres eliminar esta regla? Esta acción no se puede deshacer.";

// MARK: - Rule Types
"rule_type.domain" = "Dominio";
"rule_type.focus_mode" = "Modo de Enfoque";
"rule_type.time" = "Tiempo";

// MARK: - Time-Based Rules
"time_rule.time.start" = "Hora de Inicio";
"time_rule.time.end" = "Hora de Fin";
"time_rule.time.section_title" = "Rango de Tiempo";
"time_rule.time.overnight_warning" = "Esta regla estará activa durante la noche (cruza la medianoche)";
"time_rule.time.active_preview" = "Activa desde %@ hasta %@";

"time_rule.days.section_title" = "Días de la Semana";
"time_rule.days.weekdays" = "Días Laborables";
"time_rule.days.weekends" = "Fines de Semana";
"time_rule.days.all_days" = "Todos los Días";
"time_rule.days.clear" = "Limpiar";

"time_rule.days.sunday" = "Domingo";
"time_rule.days.monday" = "Lunes";
"time_rule.days.tuesday" = "Martes";
"time_rule.days.wednesday" = "Miércoles";
"time_rule.days.thursday" = "Jueves";
"time_rule.days.friday" = "Viernes";
"time_rule.days.saturday" = "Sábado";

"time_rule.days.sun" = "Dom";
"time_rule.days.mon" = "Lun";
"time_rule.days.tue" = "Mar";
"time_rule.days.wed" = "Mié";
"time_rule.days.thu" = "Jue";
"time_rule.days.fri" = "Vie";
"time_rule.days.sat" = "Sáb";

"time_rule.days.active_on" = "Activa en: %@";

"time_rule.preview.title" = "Vista Previa de Regla";
"time_rule.preview.summary" = "Activa en %@ desde %@ hasta %@";
"time_rule.preview.every_day" = "Todos los días";

"time_rule.validation.invalid_time_range" = "La hora de inicio y fin no pueden ser iguales";
"time_rule.validation.no_days_selected" = "Por favor selecciona al menos un día";
"time_rule.validation.duplicate_range" = "Este rango de tiempo ya existe para los días seleccionados";

// MARK: - Browser Selection
"browser_selection.title" = "Elegir un Navegador";
"browser_selection.subtitle" = "Selecciona qué navegador debe abrir este enlace";
"browser_selection.url_label" = "Abriendo:";
"browser_selection.remember" = "Recordar esta elección";
"browser_selection.action" = "Abrir";

// MARK: - About View
"about.title" = "Acerca de";
"about.app_subtitle" = "Selector Inteligente de Navegador";
"about.version" = "Versión";
"about.build" = "Compilación";

"about.section.what_is" = "¿Qué es Proxly?";
"about.description.main" = "Proxly es un selector inteligente de navegador que enruta automáticamente enlaces web al navegador correcto basándose en reglas personalizables.";
"about.description.detail" = "Nunca más te preocupes por abrir enlaces de trabajo en tu navegador personal o viceversa. Configura reglas basadas en dominios, modos de enfoque o hora del día, y deja que Proxly se encargue del resto.";

"about.section.features" = "Características Principales";
"about.feature.domain_rules.title" = "Reglas Basadas en Dominio";
"about.feature.domain_rules.description" = "Enruta sitios web específicos a navegadores designados";
"about.feature.focus_mode.title" = "Integración con Modo de Enfoque";
"about.feature.focus_mode.description" = "Diferentes navegadores para tiempo de trabajo y personal";
"about.feature.time_based.title" = "Enrutamiento Basado en Tiempo";
"about.feature.time_based.description" = "Selección automática de navegador basada en la hora del día";
"about.feature.priority.title" = "Sistema de Prioridades";
"about.feature.priority.description" = "Ajusta finamente la precedencia de reglas con niveles de prioridad";

"about.feature.menu_bar.title" = "Integración con la barra de menús";
"about.feature.menu_bar.description" = "Acceso rápido a reglas y configuraciones desde la barra de menús";

"about.section.developer" = "Desarrollador";
"about.developer.name" = "Paweł Mazurkiewicz";
"about.developer.role" = "Desarrollador de macOS";
"about.developer.description" = "Creando aplicaciones hermosas y funcionales para Mac.";

"about.section.links" = "Enlaces y Soporte";
"about.link.website" = "Sitio Web";
"about.link.support" = "Soporte";
"about.link.support_description" = "¿Necesitas soporte? ¡Házmelo saber!";
"about.link.feature_request" = "Solicitar una característica";
"about.link.feature_request_description" = "¿Tienes una idea para una nueva característica? ¡Compártela!";
"about.link.rate" = "Calificar Proxly en la App Store";
"about.link.rate_description" = "Si disfrutas usando Proxly, ¡considera dejar una calificación en la App Store!";
"about.link.github" = "Código Fuente";

// MARK: - Menu Bar
"menu.toggle_rules" = "Alternar Reglas";
"menu.open_settings" = "Abrir Configuración...";
"menu.quit" = "Salir de Proxly";

// MARK: - Errors
"error.app_not_found" = "Aplicación con ID de paquete '%@' no encontrada.";
"error.open_failed" = "Error al abrir URL: %@";

/* Rule List */
"rule_list_title" = "Reglas";
"rule_list_subtitle" = "Gestiona tus reglas de enrutamiento de navegador";
"rule_list_browser" = "Navegador";
"rule_list_priority" = "Prioridad";

// MARK: - Focus Mode
"focus.app_filter.title" = "Filtro de enfoque de la aplicación";
"focus.app_filter.description" = "Configurar el comportamiento de la aplicación para diferentes modos de enfoque";
"focus.display_representation.title" = "Enfoque: %@";
"focus.display_representation.subtitle" = "Comportamiento personalizado de la aplicación para este enfoque";
"focus.unnamed" = "Sin nombre";

"focus.status.not_determined" = "No determinado";
"focus.status.restricted" = "Restringido";
"focus.status.denied" = "Denegado";
"focus.status.authorized" = "Autorizado";
"focus.status.unknown" = "Desconocido";

"focus.info.status.active" = "Activo";
"focus.info.status.inactive" = "Inactivo";
"focus.info.authorization" = "Autorización";
"focus.info.name" = "Nombre de enfoque";
"focus.info.name.not_available" = "No disponible (requiere configuración del usuario)";

// MARK: - Focus Suggestions
"focus.suggestion.work" = "Trabajo";
"focus.suggestion.personal" = "Personal";
"focus.suggestion.sleep" = "Dormir";
"focus.suggestion.do_not_disturb" = "No molestar";

// MARK: - Accessibility
"accessibility.section.label" = "Sección";

// Rule Edit Accessibility
"accessibility.rule_edit.name.label" = "Nombre de la regla";
"accessibility.rule_edit.name.hint" = "Ingrese un nombre descriptivo para esta regla";

"accessibility.rule_edit.rule_type.section_label" = "Selección de tipo de regla";
"accessibility.rule_edit.rule_type.domain.label" = "Regla basada en dominio";
"accessibility.rule_edit.rule_type.domain.hint" = "Crear una regla que coincida con dominios de sitios web";
"accessibility.rule_edit.rule_type.focus_mode.label" = "Regla de modo de concentración";
"accessibility.rule_edit.rule_type.focus_mode.hint" = "Crear una regla que se active durante modos de concentración específicos";
"accessibility.rule_edit.rule_type.time.label" = "Regla basada en tiempo";
"accessibility.rule_edit.rule_type.time.hint" = "Crear una regla que se active durante horarios y días específicos";

"accessibility.rule_edit.condition.label" = "Condición de la regla";
"accessibility.rule_edit.condition.hint" = "Ingrese la condición que activará esta regla";
"accessibility.rule_edit.condition.section_label" = "Condición de la regla";

"accessibility.rule_edit.browser.section_label" = "Selección de navegador objetivo";
"accessibility.rule_edit.browser.selected_hint" = "Toque para seleccionar un navegador diferente";
"accessibility.rule_edit.browser.unselected_hint" = "Toque para seleccionar este navegador";
"accessibility.rule_edit.browser.selected_label" = "Navegador %@, actualmente seleccionado";
"accessibility.rule_edit.browser.unselected_label" = "Navegador %@, no seleccionado";

"accessibility.rule_edit.browser_row.selected_label" = "Navegador seleccionado";
"accessibility.rule_edit.browser_row.unselected_label" = "Navegador disponible";
"accessibility.rule_edit.browser_row.selected_hint" = "Este navegador está actualmente seleccionado para esta regla";
"accessibility.rule_edit.browser_row.unselected_hint" = "Toque para seleccionar este navegador para esta regla";

"accessibility.rule_edit.priority.label" = "Prioridad de la regla";
"accessibility.rule_edit.priority.hint" = "Ajuste el nivel de prioridad para esta regla. Las reglas de mayor prioridad tienen precedencia";
"accessibility.rule_edit.priority.section_label" = "Configuración de prioridad";
"accessibility.rule_edit.priority.value_label" = "Nivel de prioridad %d";

"accessibility.rule_edit.button.save.hint" = "Guardar la configuración actual de la regla";
"accessibility.rule_edit.button.save.hint_disabled" = "Complete todos los campos requeridos para guardar la regla";
"accessibility.rule_edit.button.cancel.hint" = "Cancelar edición y descartar cambios";
"accessibility.rule_edit.button.delete.hint" = "Eliminar esta regla permanentemente";
"accessibility.rule_edit.button.delete.label" = "Eliminar regla";

"accessibility.rule_edit.validation.error_label" = "Error de validación";
"accessibility.rule_edit.validation.success_label" = "Validación exitosa";

"accessibility.rule_edit.success.label" = "Regla guardada exitosamente";
"accessibility.rule_edit.success.hint" = "La regla ha sido guardada y ahora está activa";

// General Accessibility
"accessibility.general.section_header" = "Encabezado de sección";
"accessibility.general.validation_message" = "Mensaje de validación";
"accessibility.general.success_indicator" = "Indicador de éxito";

// Browser Selection Accessibility
"accessibility.browser_selection.row_label" = "Opción de navegador";
"accessibility.browser_selection.selected_state" = "Seleccionado";
"accessibility.browser_selection.unselected_state" = "No seleccionado";

// Time-Based Rule Accessibility
"accessibility.time_based_rule.time_range.section_label" = "Configuración de rango de tiempo";
"accessibility.time_based_rule.time_range.start_time_label" = "Hora de inicio";
"accessibility.time_based_rule.time_range.end_time_label" = "Hora de fin";
"accessibility.time_based_rule.time_range.start_time_hint" = "Establezca la hora cuando esta regla se vuelva activa";
"accessibility.time_based_rule.time_range.end_time_hint" = "Establezca la hora cuando esta regla se vuelva inactiva";

"accessibility.time_based_rule.day_selection.section_label" = "Selección de días";
"accessibility.time_based_rule.day_selection.day_selected_hint" = "Este día está incluido en la regla";
"accessibility.time_based_rule.day_selection.day_unselected_hint" = "Toque para incluir este día en la regla";

"accessibility.time_based_rule.preview.label" = "Vista previa de la regla";
"accessibility.time_based_rule.preview.hint" = "Resumen de cuándo esta regla estará activa";

"accessibility.time_based_rule.time_range.overnight_warning_label" = "Advertencia de rango nocturno: esta regla estará activa durante la medianoche";
"accessibility.time_based_rule.time_range.preview_label" = "Vista previa del rango de tiempo activo";
"accessibility.time_based_rule.day_selection.day_button_label" = "Día: %@, Estado: %@";
"accessibility.time_based_rule.day_selection.clear_button_label" = "Limpiar selección";
"accessibility.time_based_rule.day_selection.clear_button_hint" = "Toca para deseleccionar todos los días de la semana";
"accessibility.time_based_rule.day_selection.preset_button_label" = "Preajuste: %@, Estado: %@";
"accessibility.time_based_rule.day_selection.preset_button_hint" = "Toca para aplicar un preajuste de día como días laborables o fines de semana";
"accessibility.time_based_rule.day_selection.selected_days_preview_label" = "Vista previa de los días seleccionados";

// MARK: - Accessibility Strings for Settings
"accessibility.settings.toolbar.title.label" = "Configuración de Proxly";
"accessibility.settings.toolbar.title.hint" = "Página principal de configuración para la aplicación Proxly";

// Settings - General Section
"accessibility.settings.general.section_label" = "Sección de Configuración General";
"accessibility.settings.general.enable_rules.label" = "Interruptor de habilitar reglas";
"accessibility.settings.general.enable_rules.hint" = "Cuando esté habilitado, todas las reglas estarán activas. Cuando esté deshabilitado, todas las reglas serán ignoradas";
"accessibility.settings.general.enable_rules.value.enabled" = "Las reglas están habilitadas";
"accessibility.settings.general.enable_rules.value.disabled" = "Las reglas están deshabilitadas";
"accessibility.settings.general.launch_at_login.label" = "Interruptor de iniciar al iniciar sesión";
"accessibility.settings.general.launch_at_login.hint" = "Cuando esté habilitado, Proxly se iniciará automáticamente cuando inicies sesión en tu Mac";
"accessibility.settings.general.launch_at_login.value.enabled" = "Iniciar al iniciar sesión está habilitado";
"accessibility.settings.general.launch_at_login.value.disabled" = "Iniciar al iniciar sesión está deshabilitado";

// Settings - Default Behavior Section
"accessibility.settings.default_behavior.section_label" = "Sección de Configuración de Comportamiento Predeterminado";
"accessibility.settings.default_behavior.picker.label" = "Selector de comportamiento predeterminado";
"accessibility.settings.default_behavior.picker.hint" = "Elige qué pasa cuando ninguna regla coincide con una URL. Mostrar selección de navegador o abrir navegador de respaldo";
"accessibility.settings.default_behavior.picker.value" = "Actualmente configurado a %@";
"accessibility.settings.fallback_browser.picker.label" = "Selector de navegador de respaldo";
"accessibility.settings.fallback_browser.picker.hint" = "Selecciona qué navegador usar como respaldo cuando ninguna regla coincide y la opción de respaldo está seleccionada";
"accessibility.settings.fallback_browser.picker.value" = "Actualmente configurado a %@";
"accessibility.settings.refresh_browsers.label" = "Botón de actualizar navegadores";
"accessibility.settings.refresh_browsers.hint" = "Toca para actualizar la lista de navegadores disponibles";
"accessibility.settings.notify_fallback.label" = "Interruptor de notificar en respaldo";
"accessibility.settings.notify_fallback.hint" = "Cuando esté habilitado, recibirás una notificación cuando una URL se abra con el navegador de respaldo";
"accessibility.settings.notify_fallback.value.enabled" = "Las notificaciones de respaldo están habilitadas";
"accessibility.settings.notify_fallback.value.disabled" = "Las notificaciones de respaldo están deshabilitadas";

// Settings - Logging Section
"accessibility.settings.logging.section_label" = "Sección de Configuración de Registro";
"accessibility.settings.logging.enable.label" = "Interruptor de habilitar registro";
"accessibility.settings.logging.enable.hint" = "Cuando esté habilitado, Proxly registrará las URLs abiertas y mensajes de diagnóstico para solución de problemas";
"accessibility.settings.logging.enable.value.enabled" = "El registro está habilitado";
"accessibility.settings.logging.enable.value.disabled" = "El registro está deshabilitado";

// MARK: - Missing Strings
"Navigation Tab Bar" = "Barra de Pestañas de Navegación";
"Unknown Browser" = "Navegador Desconocido";
"%@ %lld" = "%@ %lld";
"" = "";

// MARK: - Direct Settings Accessibility Keys (matching LocalizationHelper structure)
"accessibility.settings.enable_rules.label" = "Interruptor de habilitar reglas";
"accessibility.settings.enable_rules.hint" = "Cuando esté habilitado, todas las reglas estarán activas. Cuando esté deshabilitado, todas las reglas serán ignoradas";
"accessibility.settings.enable_rules.value.enabled" = "Las reglas están habilitadas";
"accessibility.settings.enable_rules.value.disabled" = "Las reglas están deshabilitadas";
"accessibility.settings.launch_at_login.label" = "Interruptor de iniciar al conectarse";
"accessibility.settings.launch_at_login.hint" = "Cuando esté habilitado, Proxly se iniciará automáticamente al conectarse a tu Mac";
"accessibility.settings.launch_at_login.value.enabled" = "Iniciar al conectarse está habilitado";
"accessibility.settings.launch_at_login.value.disabled" = "Iniciar al conectarse está deshabilitado";

// MARK: - About Accessibility
"accessibility.about.toolbar.title.label" = "Acerca de Proxly";
"accessibility.about.toolbar.title.hint" = "Información sobre la aplicación Proxly, características y desarrollador";

"accessibility.about.navigation.scroll_view.label" = "Información acerca de";
"accessibility.about.navigation.scroll_view.hint" = "Desplázate para ver información de la aplicación, características y enlaces";

"accessibility.about.app_info.section_label" = "Información de la Aplicación";
"accessibility.about.app_info.app_icon.label" = "Icono de la aplicación Proxly";
"accessibility.about.app_info.app_icon.hint" = "Icono oficial de la aplicación Proxly";
"accessibility.about.app_info.app_name.label" = "Proxly - Enrutador Inteligente de Navegador";
"accessibility.about.app_info.app_subtitle.label" = "Enrutamiento inteligente de navegador para macOS";
"accessibility.about.app_info.version_badge.label" = "%@ %@";
"accessibility.about.app_info.version_badge.hint" = "Información de versión y compilación de la aplicación";

"accessibility.about.description.section_label" = "Descripción de la Aplicación";
"accessibility.about.description.section_hint" = "Aprende qué hace Proxly y cómo ayuda con la gestión de navegadores";
"accessibility.about.description.main_text.label" = "Descripción principal de la aplicación";
"accessibility.about.description.detail_text.label" = "Descripción detallada de la aplicación";

"accessibility.about.features.section_label" = "Características de la Aplicación";
"accessibility.about.features.section_hint" = "Descubre todas las características poderosas que ofrece Proxly";
"accessibility.about.features.feature_row.label" = "Característica: %@";
"accessibility.about.features.feature_row.hint" = "Descripción: %@";
"accessibility.about.features.feature_list.label" = "Lista de características de Proxly";

"accessibility.about.developer.section_label" = "Información del Desarrollador";
"accessibility.about.developer.section_hint" = "Conoce sobre la persona que creó Proxly";
"accessibility.about.developer.photo.label" = "Foto del desarrollador";
"accessibility.about.developer.photo.hint" = "Foto de Paweł Mazurkiewicz, el desarrollador de Proxly";
"accessibility.about.developer.name.label" = "Nombre del desarrollador: Paweł Mazurkiewicz";
"accessibility.about.developer.role.label" = "Función: Desarrollador de macOS";
"accessibility.about.developer.description.label" = "Biografía: Creando aplicaciones hermosas y funcionales para Mac";

"accessibility.about.links.section_label" = "Enlaces y Soporte";
"accessibility.about.links.section_hint" = "Acceso a soporte, solicitud de características y calificación de la aplicación";
"accessibility.about.links.link_button.label" = "Botón de %@";
"accessibility.about.links.link_button.hint" = "%@ - toca para abrir";
"accessibility.about.links.support_button.label" = "Contactar Soporte";
"accessibility.about.links.support_button.hint" = "Envía un correo para obtener ayuda con Proxly o reportar errores";
"accessibility.about.links.feature_request_button.label" = "Solicitar Característica";
"accessibility.about.links.feature_request_button.hint" = "Envía un correo para sugerir nuevas características para Proxly";
"accessibility.about.links.rate_button.label" = "Calificar en App Store";
"accessibility.about.links.rate_button.hint" = "Abre el App Store para calificar y reseñar Proxly";

// MARK: - Additional Settings Accessibility
"accessibility.settings.enable_rules.label" = "Interruptor de habilitar reglas";
"accessibility.settings.enable_rules.hint" = "Cuando esté habilitado, todas las reglas estarán activas. Cuando esté deshabilitado, todas las reglas serán ignoradas";
"accessibility.settings.enable_rules.value.enabled" = "Las reglas están habilitadas";
"accessibility.settings.enable_rules.value.disabled" = "Las reglas están deshabilitadas";
"accessibility.settings.launch_at_login.label" = "Interruptor de iniciar al conectarse";
"accessibility.settings.launch_at_login.hint" = "Cuando esté habilitado, Proxly se iniciará automáticamente al conectarse a tu Mac";
"accessibility.settings.launch_at_login.value.enabled" = "Iniciar al conectarse está habilitado";
"accessibility.settings.launch_at_login.value.disabled" = "Iniciar al conectarse está deshabilitado";

// MARK: - ContentView Accessibility
"accessibility.content_view.container_label" = "Ventana Principal de Proxly";
"accessibility.content_view.container_hint" = "La ventana principal de la aplicación que contiene pestañas de navegación para Reglas, Configuración y Acerca de";

"accessibility.content_view.tab_view.container_label" = "Navegación Principal";
"accessibility.content_view.tab_view.container_hint" = "Navegación por pestañas para cambiar entre diferentes secciones de Proxly";

"accessibility.content_view.tab.rules.label" = "Pestaña de Reglas";
"accessibility.content_view.tab.rules.hint" = "Toca para ver y gestionar las reglas de enrutamiento del navegador";
"accessibility.content_view.tab.rules.selected" = "Pestaña de reglas seleccionada";
"accessibility.content_view.tab.rules.unselected" = "Pestaña de reglas no seleccionada";

"accessibility.content_view.tab.settings.label" = "Pestaña de Configuración";
"accessibility.content_view.tab.settings.hint" = "Toca para ver y modificar la configuración de la aplicación";
"accessibility.content_view.tab.settings.selected" = "Pestaña de configuración seleccionada";
"accessibility.content_view.tab.settings.unselected" = "Pestaña de configuración no seleccionada";

"accessibility.content_view.tab.about.label" = "Pestaña de Acerca de";
"accessibility.content_view.tab.about.hint" = "Toca para ver información sobre Proxly y detalles del desarrollador";
"accessibility.content_view.tab.about.selected" = "Pestaña de acerca de seleccionada";
"accessibility.content_view.tab.about.unselected" = "Pestaña de acerca de no seleccionada";

// MARK: - RuleList Accessibility
"accessibility.rule_list.navigation.container_label" = "Navegación de Reglas";
"accessibility.rule_list.navigation.container_hint" = "Navegación de vista dividida que contiene lista de reglas e interfaz de edición";
"accessibility.rule_list.navigation.sidebar_label" = "Barra Lateral de Reglas";
"accessibility.rule_list.navigation.sidebar_hint" = "Lista de todas tus reglas de enrutamiento de navegador";

"accessibility.rule_list.toolbar.title_label" = "Título de Pantalla de Reglas";
"accessibility.rule_list.toolbar.title_hint" = "Título principal para la pantalla de gestión de reglas";

"accessibility.rule_list.button.add_rule_label" = "Agregar Regla";
"accessibility.rule_list.button.add_rule_hint" = "Toca para crear una nueva regla de enrutamiento de navegador";

"accessibility.rule_list.toggle.rules_enabled_label" = "Interruptor de Reglas Habilitadas";
"accessibility.rule_list.toggle.rules_enabled_hint" = "Alternar para habilitar o deshabilitar todas las reglas. Cuando está deshabilitado, todas las reglas serán ignoradas";
"accessibility.rule_list.toggle.rules_enabled_value_on" = "Las reglas están habilitadas";
"accessibility.rule_list.toggle.rules_enabled_value_off" = "Las reglas están deshabilitadas";

"accessibility.rule_list.empty_state.container_label" = "Mensaje de Sin Reglas";
"accessibility.rule_list.empty_state.container_hint" = "Pantalla de información cuando no se han creado reglas aún";
"accessibility.rule_list.empty_state.description_label" = "Descripción de Sin Reglas";
"accessibility.rule_list.empty_state.description_hint" = "Explicación de qué hacen las reglas y por qué son útiles";
"accessibility.rule_list.empty_state.create_button_label" = "Crear Primera Regla";
"accessibility.rule_list.empty_state.create_button_hint" = "Toca para crear tu primera regla de enrutamiento de navegador";

"accessibility.rule_list.list.scroll_view_label" = "Lista de Reglas";
"accessibility.rule_list.list.scroll_view_hint" = "Lista desplazable que contiene %d reglas";

"accessibility.rule_list.rule_card.button_label" = "Regla %@";
"accessibility.rule_list.rule_card.button_hint" = "Toca para ver y editar esta regla";
"accessibility.rule_list.rule_card.selected_value" = "Seleccionado";
"accessibility.rule_list.rule_card.unselected_value" = "No seleccionado";

"accessibility.rule_list.rule_card.type_label" = "Tipo de regla: %@";
"accessibility.rule_list.rule_card.type_hint" = "El tipo de condición que coincide con esta regla";

"accessibility.rule_list.rule_card.name_label" = "Nombre de regla: %@";

"accessibility.rule_list.rule_card.condition_label" = "Condición: %@";

"accessibility.rule_list.rule_card.browser_label" = "Navegador objetivo: %@";
"accessibility.rule_list.rule_card.browser_hint" = "El navegador que abrirá enlaces que coincidan con esta regla";

"accessibility.rule_list.rule_card.priority_label" = "Prioridad: %d";
"accessibility.rule_list.rule_card.priority_hint" = "Nivel de prioridad de la regla - números más altos tienen precedencia";

"accessibility.rule_list.detail.edit_view_label" = "Editar Regla %@";
"accessibility.rule_list.detail.edit_view_hint" = "Interfaz de edición de regla para modificar configuraciones de la regla";
"accessibility.rule_list.detail.placeholder_label" = "Seleccionar una Regla";
"accessibility.rule_list.detail.placeholder_hint" = "Elige una regla de la lista para ver y editar sus detalles";

// MARK: - MenuBarManager Accessibility
"accessibility.menu_bar_manager.status_item.label" = "Botón de Estado de Proxly";
"accessibility.menu_bar_manager.status_item.hint_enabled" = "Haz clic para abrir el menú de Proxly. Las reglas están habilitadas";
"accessibility.menu_bar_manager.status_item.hint_disabled" = "Haz clic para abrir el menú de Proxly. Las reglas están deshabilitadas";
"accessibility.menu_bar_manager.status_item.role_description" = "Aplicación de barra de menú de Proxly";
"accessibility.menu_bar_manager.status_item.value_enabled" = "Reglas habilitadas";
"accessibility.menu_bar_manager.status_item.value_disabled" = "Reglas deshabilitadas";

"accessibility.menu_bar_manager.menu.container_label" = "Menú de Proxly";
"accessibility.menu_bar_manager.menu.container_hint" = "Menú principal con opciones para reglas, configuración y control de la aplicación";

"accessibility.menu_bar_manager.menu.toggle_rules.label" = "Alternar Reglas";
"accessibility.menu_bar_manager.menu.toggle_rules.hint" = "Habilitar o deshabilitar todas las reglas de enrutamiento de navegador";
"accessibility.menu_bar_manager.menu.open_settings.label" = "Abrir Configuración";
"accessibility.menu_bar_manager.menu.open_settings.hint" = "Abrir la configuración de Proxly para configurar la aplicación";
"accessibility.menu_bar_manager.menu.quit.label" = "Salir de Proxly";
"accessibility.menu_bar_manager.menu.quit.hint" = "Cerrar la aplicación Proxly";

"accessibility.menu_bar_manager.actions.toggle_rules_description" = "Alternar Reglas";
"accessibility.menu_bar_manager.actions.open_settings_description" = "Abrir Configuración";
"accessibility.menu_bar_manager.actions.quit_description" = "Salir de Proxly";

// MARK: - SelectionPanel Accessibility
"accessibility.selection_panel.container.label" = "Panel de selección de navegador";
"accessibility.selection_panel.container.hint" = "Elige con qué navegador abrir el enlace. Usa las teclas de flecha para navegar, Enter para seleccionar o Escape para cancelar";
"accessibility.selection_panel.container.role_description" = "Diálogo modal para selección de navegador";

"accessibility.selection_panel.header.section_label" = "Encabezado de selección de navegador";
"accessibility.selection_panel.header.title.label" = "Elige un Navegador";
"accessibility.selection_panel.header.title.hint" = "Título principal para el diálogo de selección de navegador";
"accessibility.selection_panel.header.subtitle.label" = "Selecciona qué navegador debe abrir este enlace";
"accessibility.selection_panel.header.subtitle.hint" = "Instrucciones para usar el diálogo de selección de navegador";
"accessibility.selection_panel.header.icon.label" = "Icono de selección de navegador";

"accessibility.selection_panel.browser_grid.container_label" = "Navegadores disponibles";
"accessibility.selection_panel.browser_grid.container_hint" = "%d navegadores disponibles. Usa las teclas de flecha para navegar entre las opciones";
"accessibility.selection_panel.browser_grid.section_label" = "Cuadrícula de opciones de navegador";

"accessibility.selection_panel.browser_card.button_label" = "Seleccionar navegador %@";
"accessibility.selection_panel.browser_card.button_label_with_shortcut" = "Seleccionar navegador %@, atajo %d";
"accessibility.selection_panel.browser_card.button_hint" = "Toca o presiona Enter para abrir el enlace con este navegador";
"accessibility.selection_panel.browser_card.button_hint_with_shortcut" = "Toca, presiona Enter o presiona %d para abrir el enlace con este navegador";
"accessibility.selection_panel.browser_card.icon_label" = "Icono del navegador %@";
"accessibility.selection_panel.browser_card.name_label" = "Nombre del navegador %@";
"accessibility.selection_panel.browser_card.shortcut_badge_label" = "Atajo %d";
"accessibility.selection_panel.browser_card.shortcut_badge_hint" = "Presiona esta tecla numérica para seleccionar rápidamente este navegador";
"accessibility.selection_panel.browser_card.role_description" = "Botón de selección de navegador";

"accessibility.selection_panel.url_section.container_label" = "Información de URL";
"accessibility.selection_panel.url_section.container_hint" = "Muestra la dirección web que se abrirá";
"accessibility.selection_panel.url_section.section_label" = "Sección de URL";
"accessibility.selection_panel.url_section.icon_label" = "Icono de enlace";
"accessibility.selection_panel.url_section.title_label" = "Abriendo:";
"accessibility.selection_panel.url_section.url_label" = "Dirección web: %@";
"accessibility.selection_panel.url_section.url_hint" = "Esta es la dirección web que se abrirá en el navegador seleccionado";

"accessibility.selection_panel.action_section.container_label" = "Acciones e instrucciones";
"accessibility.selection_panel.action_section.container_hint" = "Contiene instrucciones de uso y opción de cancelar";
"accessibility.selection_panel.action_section.section_label" = "Sección de acciones";
"accessibility.selection_panel.action_section.instructions_label" = "Presiona 1-9 o haz clic para seleccionar";
"accessibility.selection_panel.action_section.instructions_hint" = "Instrucciones para seleccionar un navegador usando atajos de teclado o mouse";
"accessibility.selection_panel.action_section.cancel_button.label" = "Cancelar selección de navegador";
"accessibility.selection_panel.action_section.cancel_button.hint" = "Cerrar el panel de selección de navegador sin abrir ningún navegador";
"accessibility.selection_panel.action_section.cancel_button.role_description" = "Botón de cancelar";

"accessibility.selection_panel.navigation.focus_moved_to_browser" = "Foco movido a opción de navegador";
"accessibility.selection_panel.navigation.focus_moved_to_cancel" = "Foco movido al botón de cancelar";
"accessibility.selection_panel.navigation.browser_selected" = "Navegador seleccionado";
"accessibility.selection_panel.navigation.panel_dismissed" = "Panel de selección de navegador cerrado";

"accessibility.selection_panel.actions.select_browser" = "Seleccionar navegador";
"accessibility.selection_panel.actions.cancel" = "Cancelar selección";
"accessibility.selection_panel.actions.dismiss" = "Cerrar panel";

"accessibility.selection_panel.announcements.panel_opened" = "Panel de selección de navegador abierto con %d navegadores disponibles para %@";
"accessibility.selection_panel.announcements.browser_focused" = "Navegador %@ enfocado";
"accessibility.selection_panel.announcements.browser_focused_with_shortcut" = "Navegador %@ enfocado, atajo %d";
"accessibility.selection_panel.announcements.browser_selected" = "Navegador %@ seleccionado, abriendo enlace";
"accessibility.selection_panel.announcements.panel_cancelled" = "Selección de navegador cancelada";
"accessibility.selection_panel.announcements.auto_dismiss_warning" = "El panel de selección de navegador se cerrará automáticamente en 10 segundos";

// MARK: - Onboarding
"onboarding.container.label" = "Bienvenida";
"onboarding.container.hint" = "Bienvenido a la introducción de Proxly. Aprende sobre las características de la app y comienza.";

// Onboarding Pages
"onboarding.page.welcome.label" = "Página de bienvenida";
"onboarding.page.welcome.hint" = "Introducción a la aplicación Proxly";
"onboarding.page.what_is.label" = "Página qué es Proxly";
"onboarding.page.what_is.hint" = "Aprende qué hace Proxly y cómo funciona";
"onboarding.page.rules.label" = "Página de reglas";
"onboarding.page.rules.hint" = "Entiende cómo funcionan las reglas en Proxly";
"onboarding.page.menu_bar.label" = "Página de barra de menú";
"onboarding.page.menu_bar.hint" = "Aprende sobre la integración con la barra de menú";
"onboarding.page.focus_modes.label" = "Página de modos de enfoque";
"onboarding.page.focus_modes.hint" = "Descubre la integración con el Modo de Enfoque";
"onboarding.page.get_started.label" = "Página de comenzar";
"onboarding.page.get_started.hint" = "Completa la configuración y comienza a usar Proxly";

// Onboarding Controls
"onboarding.button.previous" = "Anterior";
"onboarding.button.previous.label" = "Página anterior";
"onboarding.button.previous.hint" = "Ir a la página anterior de la introducción";
"onboarding.button.next" = "Siguiente";
"onboarding.button.next.label" = "Página siguiente";
"onboarding.button.next.hint" = "Ir a la página siguiente de la introducción";
"onboarding.button.get_started" = "Comenzar";
"onboarding.button.get_started.label" = "Comenzar";
"onboarding.button.get_started.hint" = "Completar la introducción y comenzar a usar Proxly";

"onboarding.page_indicator.label" = "Indicador de página";
"onboarding.page_indicator.value" = "Página %d de %d";
"onboarding.page_indicator.hint" = "Posición actual de la página en la introducción";
"onboarding.page_indicators.label" = "Indicadores de página";
"onboarding.page_indicators.value" = "Página %d de %d";

// Symbol Accessibility
"onboarding.symbol.light.label" = "Símbolo de la aplicación Proxly en modo claro";
"onboarding.symbol.light.hint" = "Símbolo decorativo de la aplicación mostrado en apariencia clara";
"onboarding.symbol.dark.label" = "Símbolo de la aplicación Proxly en modo oscuro";
"onboarding.symbol.dark.hint" = "Símbolo decorativo de la aplicación mostrado en apariencia oscura";

// Welcome Page
"onboarding.welcome.title" = "¡Bienvenido a Proxly!";
"onboarding.welcome.subtitle" = "Toma el control de tu experiencia de navegación web";
"onboarding.welcome.description" = "Proxly te ayuda a gestionar cómo se abren los enlaces, enrutándolos sin esfuerzo al navegador correcto basándose en tus reglas personalizadas.";
"onboarding.welcome.app_icon.label" = "Icono de la aplicación Proxly";
"onboarding.welcome.app_icon.hint" = "El icono oficial de la app Proxly";

// What is Proxly Page
"onboarding.what_is.title" = "¿Qué Puede Hacer Proxly por Ti?";
"onboarding.what_is.subtitle" = "Enrutamiento inteligente de navegador hecho simple";
"onboarding.what_is.urls.title" = "URLs";
"onboarding.what_is.browsers.title" = "Navegadores";
"onboarding.what_is.explanation" = "Proxly abre automáticamente enlaces en el navegador correcto o app, o incluso puede bloquearlos, todo basado en tus reglas personalizadas. ¡No más copiar y pegar enlaces manualmente!";

// What is Proxly Demo Accessibility
"onboarding.what_is.urls.demo.label" = "Demostración de URLs de ejemplo";
"onboarding.what_is.urls.demo.hint" = "Muestra URLs de sitios web de ejemplo que pueden ser enrutadas por Proxly";
"onboarding.what_is.arrow.label" = "Flecha indicando dirección";
"onboarding.what_is.arrow.hint" = "Muestra el flujo de URLs a navegadores";
"onboarding.what_is.browsers.demo.label" = "Demostración de navegadores de ejemplo";
"onboarding.what_is.browsers.demo.hint" = "Muestra navegadores de ejemplo que pueden ser utilizados como destinos de enrutamiento";

// Demo Components Accessibility
"onboarding.url_demo.label" = "URL de sitio web de ejemplo";
"onboarding.url_demo.hint" = "Demuestra cómo diferentes sitios web pueden ser categorizados para enrutamiento";
"onboarding.browser_demo.label" = "Opción de navegador de ejemplo";
"onboarding.browser_demo.hint" = "Demuestra opciones de navegador disponibles para enrutamiento";

// Rules Page
"onboarding.rules.title" = "Tú Tienes el Control con las Reglas";
"onboarding.rules.subtitle" = "Las reglas son el corazón de Proxly";
"onboarding.rules.example.work.title" = "Dominios de Trabajo";
"onboarding.rules.example.work.description" = "Siempre abrir enlaces de dominio-trabajo.com en Chrome";
"onboarding.rules.example.social.title" = "Redes Sociales";
"onboarding.rules.example.social.description" = "Abrir enlaces de redes sociales en tu navegador favorito";
"onboarding.rules.example.focus.title" = "Modo de Enfoque";
"onboarding.rules.example.focus.description" = "Bloquear sitio-distractor.com cuando el Modo de Enfoque de Trabajo esté activo";

// Rules Examples Accessibility
"onboarding.rules.example.work.accessibility.label" = "Ejemplo de regla de dominio de trabajo";
"onboarding.rules.example.work.accessibility.hint" = "Demuestra cómo enrutar sitios web relacionados con el trabajo a navegadores específicos";
"onboarding.rules.example.social.accessibility.label" = "Ejemplo de regla de redes sociales";
"onboarding.rules.example.social.accessibility.hint" = "Demuestra cómo enrutar sitios web de redes sociales a navegadores preferidos";
"onboarding.rules.example.focus.accessibility.label" = "Ejemplo de regla de modo de enfoque";
"onboarding.rules.example.focus.accessibility.hint" = "Demuestra cómo bloquear sitios web que distraen durante el tiempo de enfoque";

// Menu Bar Page
"onboarding.menu_bar.title" = "Acceso Rápido desde tu Barra de Menú";
"onboarding.menu_bar.subtitle" = "Mantén un ojo en Proxly y gestiónalo fácilmente";
"onboarding.menu_bar.proxly_icon.label" = "Icono de Proxly en la barra de menú";
"onboarding.menu_bar.proxly_icon.hint" = "El icono de Proxly en la barra de menú de tu Mac";
"onboarding.menu_bar.feature.status.title" = "Ver si Proxly está activo";
"onboarding.menu_bar.feature.status.description" = "El indicador visual muestra cuando las reglas están habilitadas";
"onboarding.menu_bar.feature.toggle.title" = "Habilitar o deshabilitar Proxly rápidamente";
"onboarding.menu_bar.feature.toggle.description" = "Alternar todas las reglas activadas o desactivadas con un clic";
"onboarding.menu_bar.feature.settings.title" = "Abrir la configuración de Proxly";
"onboarding.menu_bar.feature.settings.description" = "Acceder al editor de reglas y configuración";

// Menu Bar Accessibility
"onboarding.menu_bar.wifi.label" = "Icono de estado del Wi-Fi";
"onboarding.menu_bar.battery.label" = "Icono de estado de la batería";
"onboarding.menu_bar.mockup.label" = "Maqueta de la barra de menú";
"onboarding.menu_bar.mockup.hint" = "Demostración de cómo aparece Proxly en la barra de menú de tu Mac";
"onboarding.menu_bar.features.label" = "Lista de características de la barra de menú";
"onboarding.menu_bar.features.hint" = "Lista las características principales disponibles desde la barra de menú";
"onboarding.menu_bar.feature.label" = "Característica de la barra de menú";
"onboarding.menu_bar.feature.hint" = "Característica individual disponible desde la barra de menú de Proxly";

// Focus Modes Page
"onboarding.focus_modes.title" = "Navegación Más Inteligente con Modos de Enfoque";
"onboarding.focus_modes.subtitle" = "Sincroniza con tus Modos de Enfoque de macOS";
"onboarding.focus_modes.work.description" = "Diferentes navegadores para tiempo de trabajo";
"onboarding.focus_modes.personal.description" = "Sitios personales durante tiempo personal";
"onboarding.focus_modes.dnd.description" = "Bloquear sitios que distraen durante No Molestar";
"onboarding.focus_modes.permission_note" = "Proxly pedirá permiso para acceder a los Modos de Enfoque para habilitar esta característica.";

// Focus Modes Examples Accessibility
"onboarding.focus_modes.work.accessibility.label" = "Ejemplo de modo de enfoque de trabajo";
"onboarding.focus_modes.work.accessibility.hint" = "Demuestra cómo Proxly puede enrutar navegadores de manera diferente durante el tiempo de enfoque de trabajo";
"onboarding.focus_modes.personal.accessibility.label" = "Ejemplo de modo de enfoque personal";
"onboarding.focus_modes.personal.accessibility.hint" = "Demuestra cómo Proxly puede enrutar navegadores de manera diferente durante el tiempo personal";
"onboarding.focus_modes.dnd.accessibility.label" = "Ejemplo de modo de enfoque No Molestar";
"onboarding.focus_modes.dnd.accessibility.hint" = "Demuestra cómo Proxly puede bloquear sitios web que distraen durante No Molestar";
"onboarding.focus_modes.permission_note.label" = "Nota de permiso de modos de enfoque";
"onboarding.focus_modes.permission_note.hint" = "Información sobre los requisitos de permiso para la integración del Modo de Enfoque";

// Get Started Page
"onboarding.get_started.title" = "¿Listo para Crear tu Primera Regla?";
"onboarding.get_started.subtitle" = "La mejor manera de experimentar Proxly es configurar tu primera regla";
"onboarding.get_started.step1.title" = "Establecer como Navegador Predeterminado";
"onboarding.get_started.step1.description" = "Establece Proxly como tu navegador predeterminado en la Configuración del Sistema";
"onboarding.get_started.step2.title" = "Crear tu Primera Regla";
"onboarding.get_started.step2.description" = "Agrega una regla para enrutar dominios específicos a tu navegador preferido";
"onboarding.get_started.step3.title" = "Probar y Disfrutar";
"onboarding.get_started.step3.description" = "Haz clic en cualquier enlace y observa a Proxly enrutarlo inteligentemente";
"onboarding.get_started.ready_message" = "¡Ya Estás Listo!";
"onboarding.get_started.help_message" = "Explora la configuración de Proxly para personalizarlo más. Siempre puedes agregar, cambiar o eliminar reglas según evolucionen tus necesidades.";

// Get Started Accessibility
"onboarding.get_started.completion.label" = "Mensaje de finalización de configuración";
"onboarding.get_started.completion.hint" = "Mensaje de felicitación indicando que la configuración de Proxly está completa";
"onboarding.setup_step.button.label" = "Paso de configuración con acción";
"onboarding.setup_step.button.hint" = "Paso de configuración interactivo que puede ser pulsado para realizar una acción";
"onboarding.setup_step.info.label" = "Información de paso de configuración";
"onboarding.setup_step.info.hint" = "Paso de configuración informativo que proporciona instrucciones para completar la configuración";
// MARK: - License Sheet
"about.license_sheet.title" = "Licencias de Código Abierto";
"about.license_sheet.description" = "Esta aplicación utiliza las siguientes bibliotecas de software de código abierto:";
"about.license_sheet.button.done" = "Hecho";
"about.license_sheet.swiftglass.name" = "SwiftGlass";
"about.license_sheet.swiftglass.version" = "Versión: 1.9.9";
"about.license_sheet.swiftglass.source" = "Fuente: https://github.com/1998code/SwiftGlass/";

// MARK: - About Links
"about.link.licenses" = "Licencias de Código Abierto";
"about.link.licenses_description" = "Ver licencias de software de código abierto";

// MARK: - License Sheet Accessibility
"accessibility.about.license_sheet.title.label" = "Licencias de Código Abierto";
"accessibility.about.license_sheet.title.hint" = "Información sobre bibliotecas de terceros utilizadas en Proxly";
"accessibility.about.license_sheet.description.label" = "Encabezado de información de licencia";
"accessibility.about.license_sheet.description.hint" = "Explica qué información se muestra en esta vista";
"accessibility.about.license_sheet.done_button.label" = "Hecho";
"accessibility.about.license_sheet.done_button.hint" = "Cierra la hoja de información de licencia";
"accessibility.about.license_sheet.swiftglass.section.label" = "Licencia de la biblioteca SwiftGlass";
"accessibility.about.license_sheet.swiftglass.section.hint" = "Información de licencia para la biblioteca SwiftGlass";
"accessibility.about.license_sheet.scroll_view.label" = "Licencias de Código Abierto";
"accessibility.about.license_sheet.scroll_view.hint" = "Desplácese para ver información de licencia para bibliotecas de terceros";

// MARK: - About Links Accessibility
"accessibility.about.links.licenses_button.label" = "Licencias de Código Abierto";
"accessibility.about.links.licenses_button.hint" = "Abre una hoja con información de licencia de software de código abierto";

// MARK: - Rule Management
"rule.remove" = "Eliminar Regla";
"rule.drop_browser" = "Descartar URL (Bloquear)";
"rule.drop_browser.description" = "Bloquear esta URL y evitar que se abra";
"rule.enable.title" = "Habilitar Regla";
"rule.enable.subtitle" = "Cuando está habilitada, esta regla estará activa y se usará para el enrutamiento de URLs";

// MARK: - Browser Profile Selector
"browser_profile_selector.profile" = "Perfil";
"browser_profile_selector.custom_arguments" = "Argumentos Personalizados";
"browser_profile_selector.no_profile_support" = "Sin soporte de perfiles";
"browser_profile_selector.permission_needed" = "Se requiere permiso";
"browser_profile_selector.permission_denied" = "Permiso denegado";
"browser_profile_selector.permission_expired" = "Permiso expirado";
"browser_profile_selector.profiles_count" = "%d perfiles";
"browser_profile_selector.no_profiles_found" = "No se encontraron perfiles";
"browser_profile_selector.standard_browser" = "Navegador estándar";
"browser_profile_selector.tap_to_enable_profiles" = "Toca para habilitar perfiles";
"browser_profile_selector.does_not_support_profiles" = "%@ no soporta perfiles";

// MARK: - Profile Permission View
"profile_permission.title" = "Soporte de Perfil del Navegador";
"profile_permission.subtitle" = "Abrir enlaces directamente en perfiles específicos del navegador";
"profile_permission.what_enables" = "Lo que esto permite:";
"profile_permission.benefit.separate_browsing.title" = "Separar navegación laboral y personal";
"profile_permission.benefit.separate_browsing.description" = "Mantén tu navegación laboral y personal completamente separada";
"profile_permission.benefit.different_extensions.title" = "Usar diferentes extensiones por perfil";
"profile_permission.benefit.different_extensions.description" = "Cada perfil puede tener su propio conjunto de extensiones y configuraciones";
"profile_permission.benefit.profile_configs.title" = "Configuraciones específicas del perfil";
"profile_permission.benefit.profile_configs.description" = "Diferentes temas, marcadores y preferencias para cada perfil";
"profile_permission.permission_required" = "Permiso requerido:";
"profile_permission.requirement.read_access.title" = "Acceso de solo lectura a directorios del navegador";
"profile_permission.requirement.read_access.description" = "Proxly necesita leer archivos de configuración para detectar tus perfiles";
"profile_permission.requirement.no_data_access.title" = "Sin acceso a datos personales";
"profile_permission.requirement.no_data_access.description" = "Solo se leen nombres de perfiles y configuraciones básicas - sin historial, contraseñas o datos de navegación";
"profile_permission.requirement.optional.title" = "Completamente opcional";
"profile_permission.requirement.optional.description" = "Puedes usar Proxly sin características de perfil - son completamente opcionales";
"profile_permission.browser_permissions" = "Permisos del navegador:";
"profile_permission.learn_more" = "Aprende Más Sobre Acceso a Datos";
"profile_permission.done" = "Hecho";
"profile_permission.state.not_requested" = "Permiso no solicitado";
"profile_permission.state.denied" = "Permiso denegado";
"profile_permission.state.granted" = "Permiso concedido";
"profile_permission.state.needs_refresh" = "El permiso necesita actualización";
"profile_permission.button.requesting" = "Solicitando...";
"profile_permission.button.grant_access" = "Conceder Acceso";
"profile_permission.button.retry" = "Reintentar";
"profile_permission.button.revoke" = "Revocar";

// MARK: - Data Access Explanation
"data_access.title" = "Explicación de Acceso a Datos";
"data_access.what_accesses" = "A qué accede Proxly:";
"data_access.access.config_files.title" = "Archivos de configuración de perfil";
"data_access.access.config_files.description" = "Archivos como 'Local State' (Chrome/Edge) y 'profiles.ini' (Firefox) que contienen nombres de perfiles y configuraciones básicas";
"data_access.access.directory_names.title" = "Nombres de directorios de perfil";
"data_access.access.directory_names.description" = "Los nombres de las carpetas de perfiles para identificar perfiles disponibles";
"data_access.never_accesses" = "A lo que Proxly NUNCA accede:";
"data_access.never.browsing_history.title" = "Historial de navegación";
"data_access.never.browsing_history.description" = "Tu historial de navegación nunca se lee o accede";
"data_access.never.passwords.title" = "Contraseñas y datos de inicio de sesión";
"data_access.never.passwords.description" = "No se accede a archivos de contraseñas o información de inicio de sesión";
"data_access.never.bookmarks.title" = "Marcadores y datos personales";
"data_access.never.bookmarks.description" = "Los marcadores personales y datos de navegación permanecen privados";
"data_access.never.cookies.title" = "Cookies y datos de sesión";
"data_access.never.cookies.description" = "No se leen cookies o información de sesión";
"data_access.technical_details" = "Detalles técnicos:";
"data_access.technical.security_bookmarks.title" = "Marcadores de seguridad con alcance";
"data_access.technical.security_bookmarks.description" = "Se utilizan marcadores de seguridad con alcance de macOS para mantener acceso solo a directorios que apruebas explícitamente";
"data_access.technical.read_only.title" = "Acceso de solo lectura";
"data_access.technical.read_only.description" = "Proxly solo solicita acceso de lectura - no puede modificar tus datos del navegador";
"data_access.technical.revocable.title" = "Permisos revocables";
"data_access.technical.revocable.description" = "Puedes revocar el acceso en cualquier momento desde la configuración de Proxly";

// MARK: - Profile Selection View
"profile_selection.enable_support" = "Habilitar Soporte de Perfil";
"profile_selection.grant_permission" = "Conceder permiso para acceder a perfiles de %@";
"profile_selection.grant_permission_button" = "Conceder Permiso";
"profile_selection.permission_denied_title" = "Permiso Denegado";
"profile_selection.permission_denied_description" = "El soporte de perfiles requiere permiso para acceder a directorios del navegador";
"profile_selection.retry_permission" = "Reintentar Permiso";
"profile_selection.permission_expired_title" = "Permiso Expirado";
"profile_selection.permission_expired_description" = "El permiso del perfil necesita actualizarse";
"profile_selection.refresh_permission" = "Actualizar Permiso";
"profile_selection.detecting_profiles" = "Detectando perfiles...";
"profile_selection.no_profiles_found" = "No se encontraron perfiles";
"profile_selection.no_profiles_description" = "No se detectaron perfiles de %@. Puedes crear perfiles en %@ y aparecerán aquí.";
"profile_selection.select_profile" = "Seleccionar un perfil:";
"profile_selection.any_profile" = "Cualquier Perfil";
"profile_selection.use_default_profile" = "Usar perfil predeterminado";
"profile_selection.default" = "Predeterminado";
"profile_selection.used_time_ago" = "Usado %@";
"profile_selection.active" = "Activo";
"profile_selection.inactive" = "Inactivo";

// MARK: - Custom Arguments View
"custom_arguments.title" = "Argumentos Personalizados";
"custom_arguments.placeholder" = "Agregar argumento (ej. --incognito)";
"custom_arguments.add" = "Agregar";
"custom_arguments.warning" = "Los argumentos personalizados pueden afectar el comportamiento del navegador. Usar con precaución.";
"custom_arguments.help.title" = "Argumentos de Navegador Personalizados";
"custom_arguments.help.common_arguments" = "Argumentos Comunes";
"custom_arguments.help.incognito.argument" = "--incognito";
"custom_arguments.help.incognito.description" = "Iniciar en modo de navegación privada/incógnito";
"custom_arguments.help.new_window.argument" = "--new-window";
"custom_arguments.help.new_window.description" = "Abrir en una nueva ventana";
"custom_arguments.help.disable_security.argument" = "--disable-web-security";
"custom_arguments.help.disable_security.description" = "Deshabilitar seguridad web (solo desarrollo)";
"custom_arguments.help.private_window.argument" = "--private-window";
"custom_arguments.help.private_window.description" = "Iniciar en modo de navegación privada";
"custom_arguments.help.new_tab.argument" = "--new-tab";
"custom_arguments.help.new_tab.description" = "Abrir URL en una nueva pestaña";
"custom_arguments.help.important_notes" = "Notas Importantes";
"custom_arguments.help.note.behavior" = "Los argumentos personalizados pueden afectar el comportamiento y seguridad del navegador";
"custom_arguments.help.note.browser_specific" = "Los argumentos son específicos del navegador y pueden no funcionar en todos los navegadores";
"custom_arguments.help.note.trust" = "Solo usa argumentos que entiendas y en los que confíes";
"custom_arguments.help.app_store_limitations" = "Limitaciones del App Store";
"custom_arguments.help.app_store_description" = "Debido a restricciones del entorno aislado del App Store, algunos argumentos pueden no funcionar como se espera. El navegador volverá al comportamiento predeterminado si los argumentos no son compatibles.";
"custom_arguments.help.done" = "Hecho";
"custom_arguments.help.compatible" = "Compatible: %@";

// MARK: - Settings Profile Features
"settings.profile_features.title" = "Características de Perfil";
"settings.profile_features.enable.title" = "Habilitar Características de Perfil";
"settings.profile_features.enable.subtitle.enabled" = "Las características de perfil están habilitadas";
"settings.profile_features.enable.subtitle.disabled" = "Las características de perfil están deshabilitadas";
"settings.profile_features.manage_permissions.title" = "Gestionar Permisos de Perfil";
"settings.profile_features.manage_permissions.subtitle" = "Configurar qué navegadores pueden acceder a datos de perfil";
"settings.profile_features.manage_permissions.button" = "Gestionar Permisos";

// MARK: - Browser Profile Accessibility
"accessibility.browser_profile_selector.profile.label" = "Selección de perfil";
"accessibility.browser_profile_selector.profile.hint" = "Elegir un perfil de navegador para esta regla";
"accessibility.browser_profile_selector.custom_arguments.label" = "Argumentos personalizados";
"accessibility.browser_profile_selector.custom_arguments.hint" = "Agregar argumentos de línea de comandos personalizados para el navegador";
"accessibility.browser_profile_selector.refresh_profiles.label" = "Actualizar perfiles";
"accessibility.browser_profile_selector.refresh_profiles.hint" = "Actualizar la lista de perfiles disponibles";

// MARK: - Profile Permission Accessibility
"accessibility.profile_permission.title.label" = "Soporte de Perfil del Navegador";
"accessibility.profile_permission.title.hint" = "Información sobre características y permisos de perfil del navegador";
"accessibility.profile_permission.benefit.label" = "Beneficio de característica de perfil";
"accessibility.profile_permission.benefit.hint" = "Explica cómo las características de perfil pueden ayudar a organizar tu navegación";
"accessibility.profile_permission.requirement.label" = "Requisito de permiso";
"accessibility.profile_permission.requirement.hint" = "Información sobre qué permisos se necesitan y por qué";
"accessibility.profile_permission.browser_row.label" = "Permiso de navegador para %@";
"accessibility.profile_permission.browser_row.hint" = "Gestionar permisos de acceso de perfil para este navegador";
"accessibility.profile_permission.learn_more.label" = "Aprender más sobre acceso a datos";
"accessibility.profile_permission.learn_more.hint" = "Abre explicación detallada de a qué datos accede Proxly";

// MARK: - Profile Selection Accessibility
"accessibility.profile_selection.enable_support.label" = "Habilitar soporte de perfil";
"accessibility.profile_selection.enable_support.hint" = "Conceder permiso para acceder a perfiles del navegador";
"accessibility.profile_selection.permission_request.label" = "Solicitud de permiso de perfil";
"accessibility.profile_selection.permission_request.hint" = "Información sobre permisos de perfil con acción para conceder acceso";
"accessibility.profile_selection.profile_card.label" = "Perfil %@";
"accessibility.profile_selection.profile_card.hint" = "Seleccionar este perfil para la regla";
"accessibility.profile_selection.any_profile.label" = "Opción cualquier perfil";
"accessibility.profile_selection.any_profile.hint" = "Usar el perfil predeterminado sin especificar uno en particular";

// MARK: - Custom Arguments Accessibility
"accessibility.custom_arguments.title.label" = "Argumentos personalizados";
"accessibility.custom_arguments.title.hint" = "Agregar argumentos de línea de comandos personalizados para el navegador";
"accessibility.custom_arguments.help.label" = "Ayuda de argumentos personalizados";
"accessibility.custom_arguments.help.hint" = "Abre información de ayuda sobre argumentos de línea de comandos del navegador";
"accessibility.custom_arguments.argument.label" = "Argumento %@";
"accessibility.custom_arguments.argument.hint" = "Toca para eliminar este argumento";
"accessibility.custom_arguments.add_field.label" = "Agregar nuevo argumento";
"accessibility.custom_arguments.add_field.hint" = "Ingresa un argumento de navegador personalizado para agregar";
"accessibility.custom_arguments.add_button.label" = "Agregar argumento";
"accessibility.custom_arguments.add_button.hint" = "Agregar el argumento ingresado a la lista";

// MARK: - Settings Profile Features Accessibility
"accessibility.settings.profile_features.section.label" = "Sección de Características de Perfil";
"accessibility.settings.profile_features.section.hint" = "Opciones de configuración para características de perfil del navegador";
"accessibility.settings.profile_features.enable.label" = "Habilitar características de perfil";
"accessibility.settings.profile_features.enable.hint" = "Cuando está habilitado, permite abrir enlaces en perfiles específicos del navegador";
"accessibility.settings.profile_features.enable.value.enabled" = "Las características de perfil están habilitadas";
"accessibility.settings.profile_features.enable.value.disabled" = "Las características de perfil están deshabilitadas";
"accessibility.settings.profile_features.manage_permissions.label" = "Gestionar permisos de perfil";
"accessibility.settings.profile_features.manage_permissions.hint" = "Abre interfaz de gestión de permisos de perfil";

/* Missing Menu Bar Manager Accessibility */
"accessibility.menu_bar_manager.status_item.button_label" = "Menú Proxly";
"accessibility.menu_bar_manager.status_item.button_hint_enabled" = "Las reglas de Proxly están habilitadas. Haga clic para abrir el menú.";
"accessibility.menu_bar_manager.actions.open_settings" = "Abrir Configuración";

/* Missing Settings Accessibility */
"accessibility.settings.show_tooltips.label" = "Alternar Mostrar Tooltips";
"accessibility.settings.show_tooltips.hint" = "Alternar para mostrar u ocultar tooltips útiles en toda la aplicación";
"accessibility.settings.show_tooltips.value.enabled" = "Los tooltips están habilitados";
"accessibility.settings.show_tooltips.value.disabled" = "Los tooltips están deshabilitados";

/* Missing Profile Features Settings */
"settings.section.profile_features" = "Características de Perfil";
"accessibility.settings.profile_features.section_label" = "Sección de Características de Perfil";
"settings.profile_features.enable" = "Habilitar Características de Perfil";
"settings.profile_features.subtitle.enabled" = "Las características de perfil están habilitadas";
"settings.profile_features.subtitle.disabled" = "Las características de perfil están deshabilitadas";
"settings.profile_features.manage_permissions" = "Gestionar Permisos de Perfil";
"settings.profile_features.manage_permissions.subtitle" = "Configurar qué navegadores pueden acceder a los datos del perfil";
"settings.profile_features.manage_permissions.button" = "Gestionar Permisos";

// MARK: - License Prompt View

// MARK: - License Management
"license.status.valid" = "Licencia válida";
"license.status.invalid" = "Inválida: %@";
"license.status.not_verified" = "Licencia no verificada";
"license.status.verifying" = "Verificando licencia...";

"license.error.empty" = "La clave de licencia no puede estar vacía";
"license.error.storage" = "Error al almacenar la clave de licencia";
"license.error.invalid_key" = "Clave de licencia inválida";
"license.error.network" = "Error de red durante la verificación";
"license.error.unknown" = "Ocurrió un error desconocido";
"license.error.invalid_url" = "URL de verificación inválida";
"license.error.invalid_response" = "Respuesta del servidor inválida";
"license.error.http_error" = "Error HTTP: %d";
"license.error.invalid_json" = "Formato de respuesta inválido";

"license.prompt.title" = "Ingresar Clave de Licencia";
"license.prompt.subtitle" = "Por favor, ingrese su clave de licencia de Proxly para continuar";
"license.prompt.placeholder" = "Ingrese su clave de licencia";
"license.prompt.verify_button" = "Verificar Licencia";
"license.prompt.quit_button" = "Salir";
"license.prompt.retry_button" = "Reintentar";

"license.onboarding.title" = "Bienvenido a Proxly";
"license.onboarding.subtitle" = "Verificación de Licencia";
"license.onboarding.description" = "Para usar Proxly, por favor ingrese su clave de licencia. Si aún no tiene una, puede adquirirla en nuestro sitio web.";

"license.prompt.input.label" = "Clave de Licencia";
"license.prompt.input.placeholder" = "Ingrese su clave de licencia";
"license.prompt.button.verify" = "Verificar Licencia";
"license.prompt.button.purchase" = "Comprar Licencia";
"license.prompt.app_store.notice" = "Esta es una versión de App Store. No se requiere verificación de licencia.";

"license.prompt.input.accessibility.label" = "Campo de entrada de clave de licencia";
"license.prompt.input.accessibility.hint" = "Ingrese aquí su clave de licencia de Proxly";
"license.prompt.status.accessibility.label" = "Estado de verificación de licencia";
"license.prompt.button.verify.accessibility.label" = "Botón verificar licencia";
"license.prompt.button.verify.accessibility.hint" = "Toque para verificar la clave de licencia ingresada";
"license.prompt.button.purchase.accessibility.label" = "Botón comprar licencia";
"license.prompt.button.purchase.accessibility.hint" = "Toque para abrir la página de compra de Proxly";
"license.prompt.app_store.accessibility.label" = "Aviso de versión App Store";

// MARK: - Onboarding License Page
"onboarding.license.title" = "Bienvenido a Proxly";
"onboarding.license.subtitle" = "Para comenzar, por favor verifique su clave de licencia o compre Proxly.";
"onboarding.license.input.label" = "Clave de Licencia";
"onboarding.license.input.placeholder" = "Ingrese su clave de licencia";
"onboarding.license.button.verify" = "Verificar Licencia";
"onboarding.license.button.purchase" = "Comprar Licencia";
"onboarding.license.app_store.notice" = "Está usando la versión de App Store. No se requiere verificación de licencia.";
"onboarding.license.help.message" = "¿Necesita ayuda? Contacte al soporte o revise su correo de compra para obtener su clave de licencia.";

"onboarding.license.input.accessibility.label" = "Campo de entrada de clave de licencia";
"onboarding.license.input.accessibility.hint" = "Ingrese su clave de licencia de Proxly para continuar";
"onboarding.license.status.accessibility.label" = "Estado de verificación de licencia";
"onboarding.license.button.verify.accessibility.label" = "Botón verificar licencia";
"onboarding.license.button.verify.accessibility.hint" = "Verificar la clave de licencia ingresada";
"onboarding.license.button.purchase.accessibility.label" = "Botón comprar licencia";
"onboarding.license.button.purchase.accessibility.hint" = "Abrir página de compra de Proxly";
"onboarding.license.app_store.accessibility.label" = "Aviso de versión App Store";
"onboarding.license.help.accessibility.label" = "Información de ayuda para licencia";

"onboarding.page.license.label" = "Página de verificación de licencia";
"onboarding.page.license.hint" = "Ingrese y verifique su clave de licencia de Proxly";

"Licensed copy" = "Copia licenciada";